Autodesk.Revit.DB.TableSectionData.SetCellCombinedParameters(System.Int32,System.Collections.Generic.IList`1{Autodesk.Revit.DB.TableCellCombinedParameterData})
Allows the caller to set combined parameter for a specified column
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetCellCombinedParameters(System.Int32,System.Int32,System.Collections.Generic.IList`1{Autodesk.Revit.DB.TableCellCombinedParameterData})
Allows the caller to set combined parameter for a specified cell
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.
-or-
This operation is forbidden for cells in standard schedule header sections.

Autodesk.Revit.DB.TableSectionData.SetCellFormatOptions(System.Int32,System.Int32,Autodesk.Revit.DB.FormatOptions)
Sets a cell's FormatOptions.
nRow:
The row index of the cell
nCol:
The column index of the cell
options:
The format option to assign
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
The display unit in options is not a valid display unit for the unit type of the cell.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.TableSectionData.SetMergedCell(System.Int32,System.Int32,Autodesk.Revit.DB.TableMergedCell)
Sets the merged cell that this cell is a part of.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.GetMergedCell(System.Int32,System.Int32)
Gets the whole merged cell that this cell is a part of.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.SetCellText(System.Int32,System.Int32,System.String)
Sets a cell's text.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.GetCellText(System.Int32,System.Int32)
Returns a cell's text depending on its type
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.InsertColumn(System.Int32,System.Boolean)
Inserts a column data at a specified index.
nIndex:
An integer index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
nIndex is invalid index.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.
Since:
2014